myinit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-09 Wed 23:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs configuration.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ymdatta" />
</head>
<body>
<div id="content">
<h1 class="title">My Emacs configuration.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4802639">1. Initial setup</a></li>
<li><a href="#orgc3ccda0">2. Interface tweaks</a></li>
<li><a href="#org87273b4">3. try</a></li>
<li><a href="#orge1ce088">4. which-key</a></li>
<li><a href="#orga14fb99">5. Org mode</a></li>
<li><a href="#org7b988d5">6. Swiper/Ivy/Counsel</a></li>
<li><a href="#org36bdc62">7. Flycheck</a></li>
<li><a href="#orge6da96e">8. beamer</a></li>
<li><a href="#org9760157">9. org-ref</a></li>
<li><a href="#org5d223fe">10. reveal.js</a></li>
<li><a href="#org93998d9">11. spaceline</a></li>
<li><a href="#org0e321d4">12. emacs-eclim</a></li>
<li><a href="#org01a0a21">13. C language related configuration</a></li>
<li><a href="#org7d51cf9">14. yasnippet</a></li>
<li><a href="#org30ebed4">15. Magit</a></li>
<li><a href="#orga7821ca">16. Rlang</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4802639" class="outline-2">
<h2 id="org4802639"><span class="section-number-2">1</span> Initial setup</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;  </span><span style="color: #b22222;">(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")</span>
<span style="color: #b22222;">;;  </span><span style="color: #b22222;">(load-theme 'midnight t)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Column numbers</span>
(<span style="color: #a020f0;">setq</span> column-number-mode t)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">whitespace mode</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3ccda0" class="outline-2">
<h2 id="orgc3ccda0"><span class="section-number-2">2</span> Interface tweaks</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq</span> inhibit-startup-message t)
(tool-bar-mode -1)

<span style="color: #b22222;">;;</span><span style="color: #b22222;">Everytime yes or no option is changed to y or n.</span>
(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>
</div>
</div>

<div id="outline-container-org87273b4" class="outline-2">
<h2 id="org87273b4"><span class="section-number-2">3</span> try</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">try</span>
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1ce088" class="outline-2">
<h2 id="orge1ce088"><span class="section-number-2">4</span> which-key</h2>
<div class="outline-text-2" id="text-4">
<p>
Brings up some help
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">which-key</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span> (which-key-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga14fb99" class="outline-2">
<h2 id="orga14fb99"><span class="section-number-2">5</span> Org mode</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Org-mode stuff</span>
(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">org-bullets</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (add-hook 'org-mode-hook (<span style="color: #a020f0;">lambda</span>() (org-bullets-mode 1))))

<span style="color: #b22222;">;;  </span><span style="color: #b22222;">ido(interactively do things) mode</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(setq ido-enable-flex-matching t)</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(setq ido-everywhere t)</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(ido-mode 1)</span>

<span style="color: #b22222;">;;</span><span style="color: #b22222;">For org-babel</span>
(org-babel-do-load-languages
 'org-babel-load-languages '((C . t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b988d5" class="outline-2">
<h2 id="org7b988d5"><span class="section-number-2">6</span> Swiper/Ivy/Counsel</h2>
<div class="outline-text-2" id="text-6">
<p>
Swiper gives us a really efficient incremental search with regular 
expressions and Ivy/Counsel replace a lot of ido or helms completion
functionality.
</p>

<p>
(Looks like counsel is requiremnt for swiper!)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">counsel</span>
  <span style="color: #483d8b;">:ensure</span> t
  )

(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">ivy</span>
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:diminish</span> (ivy-mode)
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-x b"</span> . ivy-switch-buffer))
  <span style="color: #483d8b;">:config</span>
  (ivy-mode 1)
  (<span style="color: #a020f0;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #a020f0;">setq</span> ivy-display-style 'fancy))

(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">swiper</span>
  <span style="color: #483d8b;">:ensure</span> try
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-s"</span> . swiper)
         (<span style="color: #8b2252;">"C-r"</span> . swiper)
         (<span style="color: #8b2252;">"C-c C-r"</span> . ivy-resume)
         (<span style="color: #8b2252;">"M-x"</span> . counsel-M-x)
         (<span style="color: #8b2252;">"C-x C-f"</span> . counsel-find-file))
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">progn</span>
    (ivy-mode 1)
    (<span style="color: #a020f0;">setq</span> ivy-use-virtual-buffers t)
    (<span style="color: #a020f0;">setq</span> ivy-display-style 'fancy)
    (define-key read-expression-map (kbd <span style="color: #8b2252;">"C-r"</span>) 'counsel-expression-history)
  ))
</pre>
</div>
</div>
</div>

<div id="outline-container-org36bdc62" class="outline-2">
<h2 id="org36bdc62"><span class="section-number-2">7</span> Flycheck</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">flycheck</span>
<span style="color: #483d8b;">:ensure</span> t
<span style="color: #483d8b;">:init</span>
(global-flycheck-mode t))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge6da96e" class="outline-2">
<h2 id="orge6da96e"><span class="section-number-2">8</span> beamer</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ox-beamer</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9760157" class="outline-2">
<h2 id="org9760157"><span class="section-number-2">9</span> org-ref</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">org-ref</span>
   <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d223fe" class="outline-2">
<h2 id="org5d223fe"><span class="section-number-2">10</span> reveal.js</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">ox-reveal</span>
<span style="color: #483d8b;">:ensure</span> ox-reveal)

(<span style="color: #a020f0;">setq</span> org-reveal-root <span style="color: #8b2252;">"http://cdn.jsdelivr.net/reveal.js/3.0.0/"</span>)
(<span style="color: #a020f0;">setq</span> org-reveal-mathjax t)

(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">htmlize</span>
 <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org93998d9" class="outline-2">
<h2 id="org93998d9"><span class="section-number-2">11</span> spaceline</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">spaceline</span> 
   <span style="color: #483d8b;">:demand</span> t
   <span style="color: #483d8b;">:init</span> 
   (<span style="color: #a020f0;">setq</span> powerline-default-seperator 'arrow-fade)
   <span style="color: #483d8b;">:config</span> 
   (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">spaceline-config</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e321d4" class="outline-2">
<h2 id="org0e321d4"><span class="section-number-2">12</span> emacs-eclim</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #a020f0;">setq</span> eclim-executable <span style="color: #8b2252;">"/home/mohanadatta/.p2/pool/plugins/org.eclim_2.8.0/bin/eclim"</span>)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">To automatically activate eclim for java source files</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">eclim</span>)
(add-hook 'jave-mode-hook 'eclim-mode)

(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">eclimd</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org01a0a21" class="outline-2">
<h2 id="org01a0a21"><span class="section-number-2">13</span> C language related configuration</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Setting style to linux - what </span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">the Linux developers use for kernel development</span>
(<span style="color: #a020f0;">setq</span> c-default-style <span style="color: #8b2252;">"linux"</span>)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">automatically indent when press RET</span>

(global-set-key (kbd <span style="color: #8b2252;">"RET"</span>) 'newline-and-indent)

</pre>
</div>
</div>
</div>
<div id="outline-container-org7d51cf9" class="outline-2">
<h2 id="org7d51cf9"><span class="section-number-2">14</span> yasnippet</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Package yasnippet</span>
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">yasnippet</span>)
(yas-global-mode 1)

</pre>
</div>
</div>
</div>
<div id="outline-container-org30ebed4" class="outline-2">
<h2 id="org30ebed4"><span class="section-number-2">15</span> Magit</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">To display information about the Current Git repository,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">'M-x magit-status RET' is used. This is a basic command,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">which is used a lot. So, this is given a global key</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">binding.</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Taken from magit manual.</span>

 (global-set-key (kbd <span style="color: #8b2252;">"C-x g"</span>) 'magit-status)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga7821ca" class="outline-2">
<h2 id="orga7821ca"><span class="section-number-2">16</span> Rlang</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">use-package</span> <span style="color: #008b8b;">ess</span>
  <span style="color: #483d8b;">:ensure</span> t
)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ymdatta</p>
<p class="date">Created: 2019-10-09 Wed 23:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
